{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Documentation:",
          "bold": true
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "This custom page was built manually, making use of clips of specific lyrics from 3 events with no annotations (\"Bobby Pickett on American Bandstand (1964),\" \"Bobby Pickett on New York at Night (1991),\" and \"ABC for Kids: Monster Mash (1991)\"). From there, the clips are arranged for aesthetic purposes and to create space for a deeper analysis of the clips."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Narrative:",
          "bold": true
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The following clips of Bobby Picket's performances of "
        },
        {
          "text": "Monster Mash",
          "italic": true
        },
        {
          "text": " on American Bandstand (1964) and New York at Night (1991), and Ross Higgins' performance of the song on ABC for Kids (1991) will be used to explore the changing meaning behind a specific lyric of the song. The clips are arranged to allow a side-by-side comparison of Bobby Pickett's two live performances, separated by 27 years. The clip of Ross Higgins' rendition appears below Bobby Pickett's performance for ease of comparison and to highlight the changes in meaning of the lyrics. Focusing on the lyrics about Dracula and his \"Transylvania twist\" highlights the cartoonish stereotypes of Dracula and his Transylvanian heritage, as well as the use of parody and satire, and the shift towards character comedy. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Lyrics",
          "bold": true
        }
      ],
      "align": "center"
    },
    {
      "type": "paragraph",
      "align": "center",
      "children": [
        {
          "text": "\"Out from his coffin, Drac's voice did ring"
        }
      ]
    },
    {
      "type": "paragraph",
      "align": "center",
      "children": [
        {
          "text": "Seems he was troubled by just one thing"
        }
      ]
    },
    {
      "type": "paragraph",
      "align": "center",
      "children": [
        {
          "text": "Opened the lid and shook his fist"
        }
      ]
    },
    {
      "type": "paragraph",
      "align": "center",
      "children": [
        {
          "text": "And said, 'Whatever happened to my Transylvania twist?'\""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "bold": true,
          "text": ""
        }
      ]
    },
    {
      "type": "grid",
      "layout": [
        3,
        3
      ],
      "children": [
        {
          "type": "column",
          "children": [
            {
              "type": "paragraph",
              "children": [
                {
                  "text": ""
                }
              ]
            },
            {
              "uuid": "2eb0a261-7f36-444c-a99c-058cd9c41664",
              "includes": [
                "media"
              ],
              "start": 160,
              "end": 173,
              "file": "88f1341b-1bf4-4dbc-a6b2-ae9210704069",
              "type": "event",
              "children": [
                {
                  "text": ""
                }
              ]
            },
            {
              "type": "paragraph",
              "children": [
                {
                  "text": ""
                }
              ]
            }
          ]
        },
        {
          "type": "column",
          "children": [
            {
              "type": "paragraph",
              "children": [
                {
                  "text": ""
                }
              ]
            },
            {
              "uuid": "6a8566ae-8b27-4b40-b9b0-3f2fedadb37f",
              "includes": [
                "media"
              ],
              "start": 188,
              "end": 201,
              "file": "20e09384-7fd0-4ce2-9216-b9197c16c081",
              "type": "event",
              "children": [
                {
                  "text": ""
                }
              ]
            },
            {
              "type": "paragraph",
              "children": [
                {
                  "text": ""
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Despite being separated by 27 years, both of Pickett's performances are quite similar. The main differences lie in the camera work. In the 1964 clip, the cameraperson provides a close-up of Pickett's face, where his exaggerated eye and mouth movements create a humorous yet spooky atmosphere. When he quotes Dracula, he elongates his face and squints to imitate the facial expressions of a cartoonish Dracula. He also employs a stereotypical Dracula accent when quoting the vampire. In his 1991 performance, the cameraperson zooms out, allowing viewers to see his entire body. Instead of relying on facial expressions, Pickett fully uses his arms and body to tell the story of the song. However, Pickett still changes his facial expressions and voice like he did in his 1964 performance. In spite of these differences, the main substance of the lyrics' meanings remains in both performances. Dracula's cry of \"whatever happened to my Transylvania twist?\" is a tongue-in-cheek reference to the Twist, a famous dance fad in the early 1960s. Pickett is poking fun of how quickly dance fads rise and fall. Additionally, these lyrics also highlight the old being pushed out by the new. Dracula and his Transylvania twist are being abandoned for a new craze, the "
        },
        {
          "text": "Monster Mash",
          "italic": true
        },
        {
          "text": "."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ],
      "align": "center"
    },
    {
      "uuid": "ec00b232-1a3b-4269-8344-e6bd639c04e1",
      "includes": [
        "media"
      ],
      "start": 121,
      "end": 128,
      "file": "480c8df5-d297-4b97-a318-5dceb0792820",
      "type": "event",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "There is a noticeable shift in Ross Higgins' performance compared to Pickett's performances. Aside from the larger-scale production with costumes, sets, and dance numbers, Higgins' performance also of these specific lyrics highlights a shift from satire to character comedy. The specific cultural reference to the Twist, although likely to be familiar to parents in the 1990s, likely would be missed by children watching ABC for Kids. Rather than a commentary on the rise and fall of dance crazes, Higgins' performance becomes just a comical complaint from Dracula. The over-the-top Dracula voice by Higgins, coupled with the child playing Dracula wildly shaking his fist, creates a fun cartoon figure rather than a symbol of the outdated. The lyrics become less of a commentary on rapidly changing cultural crazes. Instead, it simply enriches the playful monster party story. "
        }
      ]
    }
  ],
  "title": "Custom page with clips (no annotations)",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "custom-page-with-clips-no-annotations",
  "created_at": "2025-09-22T05:35:56.560Z",
  "created_by": "raymondhyser",
  "updated_at": "2025-09-22T18:00:41.897Z",
  "updated_by": "raymondhyser"
}